avnet-iotconnect/iotc-stm32-n6-demos/main.c
  if(USART_STATUS == HAL_TIMEOUT)
  {
    memset  (response, 0, RX_BUFFER_SIZE);
    snprintf(response, TX_BUFFER_SIZE, "ERROR\r\n");
  }

#if 0
  //printf("response received is %s\n", response);
  // printf("len is %d\n", i);

  printf("response is: \n");
  for (int j = 0; j < i ; j++) {
	  printf("%d\n", response[j]);
  }
#endif
  return response;
}
/***IoTC-stop1***/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  NPURam_enable();

  Fuse_Programming();

  NPUCache_config();

  MX_USART2_UART_Init(); // Initialize UART

  /*** External RAM and NOR Flash *********************************************/
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);

  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

  /*** NN Init ****************************************************************/
  LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(Default);
  const LL_Buffer_InfoTypeDef *nn_in_info = LL_ATON_Input_Buffers_Info_Default();
  const LL_Buffer_InfoTypeDef *nn_out_info = LL_ATON_Output_Buffers_Info_Default();

  nn_in = (uint8_t *) LL_Buffer_addr_start(&nn_in_info[0]);
  float32_t *nn_out[MAX_NUMBER_OUTPUT];
  int32_t nn_out_len[MAX_NUMBER_OUTPUT];

  int number_output = 0;

  /* Count number of outputs */
  while (nn_out_info[number_output].name != NULL)
  {
    number_output++;
  }
  assert(number_output <= MAX_NUMBER_OUTPUT);

  for (int i = 0; i < number_output; i++)
  {
    nn_out[i] = (float32_t *) LL_Buffer_addr_start(&nn_out_info[i]);
    nn_out_len[i] = LL_Buffer_len(&nn_out_info[i]);
  }

  uint32_t nn_in_len = LL_Buffer_len(&nn_in_info[0]);
  uint32_t pitch_nn = 0;

  UNUSED(nn_in_len);

  /*** Post Processing Init ***************************************************/
  pp_input = nn_out[0];

  /*** Camera Init ************************************************************/

  CAM_Init(&lcd_bg_area.XSize, &lcd_bg_area.YSize, &pitch_nn);

  LCD_init();

  /* Start LCD Display camera pipe stream */
  CAM_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App Loop ***************************************************************/
  while (1)
  {
      da16k_cmd_t current_cmd = {0};

      // Attempt to receive a command
      HAL_Delay(50); // small 50ms pause

      da16k_err_t get_ret = da16k_get_cmd(&current_cmd);
      if (get_ret == DA16K_SUCCESS)
      {
          printf("Got command: '%s'\n",
                 current_cmd.command ? current_cmd.command : "(null)");
          printf("Params: '%s'\n",
                 current_cmd.parameters ? current_cmd.parameters : "(null)");

          // Check if it is SET_CONFIDENCE_THRESHOLD
          #define CMD_STR "SET_CONFIDENCE_THRESHOLD"
          if (current_cmd.command &&
              strcmp(current_cmd.command, CMD_STR) == 0)
          {
              // We got the right command
              if (current_cmd.parameters)
              {
                  int new_threshold = atoi(current_cmd.parameters);
                  if (new_threshold >= 0 && new_threshold <= 100) {
                      confidence_threshold = new_threshold;
                      printf("Updated threshold to %d%%\n", confidence_threshold);

                      // Acknowledge
                      da16k_at_send_formatted_raw_no_crlf(
                        "AT+NWICMSG threshold_updated,%d\r\n", confidence_threshold
                      );
                  } else {
                      printf("Invalid threshold: %d\n", new_threshold);
                  }
              }
          }
          else
          {
              printf("Unrecognized command: '%s'\n",
                     current_cmd.command ? current_cmd.command : "(null)");
          }

          // Clean up
          da16k_destroy_cmd(current_cmd);
      }
      else if (get_ret == DA16K_NO_CMDS)
      {
          // No new commands from the module
          // ...
      }
      else
      {
          // Some error occurred
          printf("Error retrieving command: %d\n", get_ret);
      }


    CAM_IspUpdate();

    if (pitch_nn != (NN_WIDTH * NN_BPP))
    {
      /* Start NN camera single capture Snapshot */
      CAM_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
    }
    else
    {
      /* Start NN camera single capture Snapshot */
      CAM_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
    }

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    uint32_t ts[2] = { 0 };

    if (pitch_nn != (NN_WIDTH * NN_BPP))
    {
      SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
      img_crop(dcmipp_out_nn, nn_in, pitch_nn, NN_WIDTH, NN_HEIGHT, NN_BPP);
      SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
    }

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    LL_ATON_RT_Main(&NN_Instance_Default);
    ts[1] = HAL_GetTick();
    Network_Postprocess();

    Display_NetworkOutput(ts[1] - ts[0]);

    // Send classification results to IoTConnect
    if ((nn_top1_output_class_proba * 100) >= confidence_threshold) {
        da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG classification,%s,conf,%.0f,threshold,%d\r\n", nn_top1_output_class_name, nn_top1_output_class_proba * 100, confidence_threshold);
    }

    // Check for commands over UART
//    char uart_buffer[100];
//    if (HAL_UART_Receive(&huart2, (uint8_t *)uart_buffer, sizeof(uart_buffer), HAL_MAX_DELAY) == HAL_OK) {
//        process_command(uart_buffer);
//    }

	HAL_Delay(2000);
    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      float32_t *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }

